app/Controllers/LoginController.php

    public function login()
    {
        $login = $this->request->getVar();
        if ($login) {
            $member_username = $this->request->getPost('member_username');
            $member_password = $this->request->getPost('member_password');

            // mengecek jika password kosong
            if ($member_username == "" || $member_password == "") {
                $error = "Silahkan Masukkan Username dan Password";
            }

            if(!$this->member->where('member_username', $member_username)->first())
            {
                $error = "Username Tidak Terdaftar";
            }

            // menggecek apakah username ada di dalam tabel atau tidak?
            if (empty($error)) {
                $dataMember = $this->member->where('member_username', $member_username)->first();
---
SELECT *
FROM `member`
WHERE `member_username` = 'as'
 LIMIT 1