app/Controllers/PendaftarController.php

INSERT INTO `pendaftar` (`nama_pendaftar`, `tempat_lahir`, `ttl`, `wa_siswa`, `nama_wali`, `wa_ortu`, `jurusan`, `siap_mengikuti`, `status_pendaftar`, `tanggal_daftar`) VALUES ('Kiki', 'makassar', '2023-02-28', '122222222222222', 'mama na aldi', '133333333333', 'Teknik Kendaraan Ringan', 'Saya Siap', 'belum registrasi ulang', '2023-02-24')
---
    public function smkInsert()
    {
        $pendaftar = new PendaftarModel();
// dd($this->request->getVar());
        $pendaftar->insert([
            "nama_pendaftar" => $this->request->getPost('nama'),
            "tempat_lahir" => $this->request->getPost("tempat"),
            "ttl" => $this->request->getVar('ttl'),
            "wa_siswa" => $this->request->getPost('no-wa'),
            "nama_wali" => $this->request->getPost('ortu'),
            "wa_ortu" => $this->request->getPost('wa-wali'),
            "jurusan" => $this->request->getVar('jurusan'),
            "siap_mengikuti" => $this->request->getVar('siap'),
            "status_pendaftar" => "belum registrasi ulang",
            "tanggal_daftar" => date("Y-m-d")
        ]);

SELECT *
FROM `pendaftar`
---
    public function viewSmk()
    {
        $pendafatar = new PendaftarModel();
        $data = [
            "title" => "admin",
            "body" => $pendafatar->findAll()