app/Controllers/PendaftarSmkController.php

    public function smkEdit($edit)
    {
        date_default_timezone_set("Asia/Makassar");
        $pendaftar = new PendaftarSmkModel();
        $id = $pendaftar->where('id', $edit)->first();
        $updateData = [
            "nama_pendaftar" => $this->request->getPost('nama_pendaftar'),
            "tempat-lahir" => $this->request->getPost("tempat-lahir"),
            "tanggal-lahir" => $this->request->getVar('tanggal-lahir'),
            "wa_siswa" => $this->request->getPost('wa-pendaftar'),
            "nama-ortu" => $this->request->getPost('nama-ortu'),
            "wa_ortu" => $this->request->getPost('wa-wali'),
            "status_pendaftar" => $this->request->getPost('status'),
            "tanggal_edit" => date("Y-m-d h-i-sa")
        ];
        $pendaftar->update($id, $updateData);
---
UPDATE `pendaftar-smk` SET `nama_pendaftar` = 'lasokodok', `tempat-lahir` = 'makassar', `tanggal-lahir` = '2023-03-02', `wa_siswa` = '08999', `nama-ortu` = 'ashjdhasd', `wa_ortu` = '08555', `status_pendaftar` = 'Telah Registrasi Ulang', `tanggal_edit` = '2023-03-02 08-56-25am'
WHERE `pendaftar-smk`.`id` IN ('39','lasokodok','makassar','2023-03-02','08999','ashjdhasd','08555','Teknik Komputer Jaringan','Saya Siap','belum registrasi ulang','2023-03-02 04:55:43',NULL)